money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов

'''
Для решения данной задачи подойдёт цикл с условием, то есть while,
так как количество месяцев, в течение которых можно прожить без долгов,
зависит от динамики расходов и подушки безопасности.
А так как неизвестно заранее сколько месяцев потребуеться, то цикл будет продолжаться
до тех пор пока условия позволяют оставаться в рамках бюджета.
'''
months = 0  # Счетчик месяцев

while money_capital + salary >= spend:
    months += 1
    money_capital += salary - spend  # Обновление подушки безопасности
    spend *= (1 + increase)  # Увеличение расходов на 5%

print("Количество месяцев, которое можно протянуть без долгов:", months)

