salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен

# TODO Рассчитайте подушку безопасности, чтобы протянуть 10 месяцев без долгов

'''
Для данной задачи лучше подойдёт цикл с заданным количествоми шагов (for),
так как известно, что необходимо расчитать расходы на фиксированное
количество месяцев.
'''
# Старт с нулевой подушки безопасности
money_capital = 0

# Рассчёт необходимой подушки безопасности
for month in range(months):
    # Расходы текущего месяца
    if month > 0:
        spend *= (1 + increase)  # Увеличение расходов на 5% начиная со второго месяца

    # Определение нехватки средств
    deficit = spend - salary

    # Если есть нехватка, то добавление её к подушке безопасности
    if deficit > 0:
        money_capital += deficit

# Округление до целого числа
money_capital = round(money_capital)

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", money_capital)
